# Analysis of the language parameter

In [10]:
from IPython.display import display, HTML
display(HTML("<style>.container { width:80% !important; }</style>"))

In [11]:
import pandas as pd
import numpy as np
import seaborn as sns
%matplotlib inline
import matplotlib.pyplot as plt
sns.set_style("darkgrid")
from tqdm.notebook import tqdm, trange
from pandas.plotting import scatter_matrix

In [12]:
path = '../data/' 
hotels = pd.read_csv(path + '/features_hotels.csv')
data = pd.read_csv(path + 'data_language_utility.csv')

In [13]:
data = data.drop(['avatar_id','request_number'],axis=1)

In [14]:
data.loc[data.hotel_id == 334]

           city  date       language  mobile  hotel_id  price  stock
0      valletta     1        maltese       1       334     79      0
49     valletta     1        latvian       1       334     82      0
115    valletta     1          czech       1       334     80      0
157    valletta     1       estonian       1       334     78      0
1029   valletta    44        maltese       1       334     68     56
...         ...   ...            ...     ...       ...    ...    ...
69256  valletta     8  luxembourgish       1       334     80      0
80720  valletta     9        maltese       1       334     79      0
80759  valletta     9     portuguese       1       334     82      0
80802  valletta     9        spanish       1       334     82      0
80849  valletta     9        spanish       1       334     82      0

[88 rows x 7 columns]

In [15]:
dic_lang = {'amsterdam':'dutch', 'copenhagen':'danish', 'madrid':'spanish', 'paris':'french', 'rome':'italian', 'sofia':'bulgarian', 'valletta':'maltese', 'vienna':'austrian' ,'vilnius':'lithuanian'}

In [16]:
# city = list(dic_lang)
# langu = [dic_lang[ci] for ci in city]
# df = pd.DataFrame([city,langu]).T
# df.rename({0:'city',1:"language_city"}, axis=1)
data.iloc[2]

city        valletta
date               1
language     maltese
mobile             1
hotel_id         732
price            176
stock              1
Name: 2, dtype: object

In [17]:
data['city_language'] = data['city'].map(dic_lang)
data['is_same_cl'] = data['city_language']==data['language']
# data['is_same_cl'] = False
# for i in range(len(data)):
#     data.iloc[i].is_same_cl = data.iloc[i].city_language == data.iloc[i].city

In [22]:
data_diff_city = data.loc[data['is_same_cl'] == False].merge(data.loc[data['is_same_cl'] == True], on = ['city','date','mobile','hotel_id'])
data_diff_city['price_diff'] = (data_diff_city['price_y']-data_diff_city['price_x'])/data_diff_city['price_x']
data_diff_city = data_diff_city[['city','date','language_x','mobile','hotel_id','price_diff']]
data_diff_city.sort_values('price_diff')

         city  date language_x  mobile  hotel_id  price_diff
49452   sofia    38    finnish       0         4   -0.108696
22477   sofia    27    spanish       0       383   -0.108696
22478   sofia    27    spanish       0       383   -0.108696
49388   sofia    38     danish       0       383   -0.108696
49386   sofia    38    finnish       0       383   -0.108696
...       ...   ...        ...     ...       ...         ...
68007  vienna    16  slovakian       1       919    0.095890
6490   vienna    22  hungarian       0       919    0.095890
23166  vienna    11  hungarian       0       919    0.095890
69971  vienna     0  bulgarian       0       919    0.095890
33717  vienna     8  slovakian       0       919    0.095890

[76509 rows x 6 columns]

In [30]:
data_diff_city_grouped = data_diff_city.groupby(['city','date','language_x','mobile']).agg({'price_diff':['mean','var']})#.price
data_diff_city_grouped

                                    price_diff
                                          mean       var
city      date language_x    mobile
amsterdam 2    austrian      1       -0.057630  0.000006
               danish        1       -0.038354  0.000006
               french        1        0.000000  0.000000
          5    irish         1       -0.019854  0.000008
               maltese       1       -0.038289  0.000005
...                                        ...       ...
vilnius   42   finnish       0       -0.038534  0.000008
               luxembourgish 0       -0.038534  0.000008
          43   cypriot       0       -0.038606  0.000006
               hungarian     0        0.018911  0.000011
               irish         0       -0.056586  0.000014

[574 rows x 2 columns]

In [34]:
data_diff_city_grouped = data_diff_city.groupby(['city','language_x']).agg({'price_diff':['mean','var']})#.price
data_diff_city_grouped

                     price_diff
                           mean       var
city      language_x
amsterdam austrian    -0.057517  0.000008
          bulgarian    0.001142  0.000007
          croatian    -0.019485  0.000009
          cypriot     -0.056665  0.000008
          czech       -0.019717  0.000009
...                         ...       ...
vilnius   polish       0.000000  0.000000
          romanian     0.019961  0.000011
          slovakian    0.019845  0.000011
          slovene     -0.018972  0.000013
          spanish     -0.056502  0.000020

[198 rows x 2 columns]

In [9]:
grouped = data.groupby(['city','date','mobile','hotel_id','is_same_cl']).agg({'price':['mean','var']})#mean()
grouped

                                                price
                                                 mean        var
city      date mobile hotel_id is_same_cl
amsterdam 2    1      9        False        86.666667   6.333333
                               True         84.000000        NaN
                      10       False       156.000000  21.000000
                               True        151.000000        NaN
                      12       False        80.666667   6.333333
...                                               ...        ...
vilnius   43   0      957      True         56.000000        NaN
                      974      False       106.666667  17.333333
                               True        104.000000        NaN
                      976      False        75.666667  10.333333
                               True         74.000000        NaN

[39840 rows x 2 columns]

In [71]:
grouped = grouped.reset_index()
grouped

            city date mobile hotel_id is_same_cl       price
                                                        mean        var
0      amsterdam    2      1        9      False   86.666667   6.333333
1      amsterdam    2      1        9       True   84.000000        NaN
2      amsterdam    2      1       10      False  156.000000  21.000000
3      amsterdam    2      1       10       True  151.000000        NaN
4      amsterdam    2      1       12      False   80.666667   6.333333
...          ...  ...    ...      ...        ...         ...        ...
39835    vilnius   43      0      957       True   56.000000        NaN
39836    vilnius   43      0      974      False  106.666667  17.333333
39837    vilnius   43      0      974       True  104.000000        NaN
39838    vilnius   43      0      976      False   75.666667  10.333333
39839    vilnius   43      0      976       True   74.000000        NaN

[39840 rows x 7 columns]

In [72]:
grouped.loc[grouped.is_same_cl == False].price['var'] #.sort_values('var')

0         6.333333
2        21.000000
4         6.333333
6        32.333333
8        31.000000
           ...
39830     4.333333
39832     9.333333
39834     4.333333
39836    17.333333
39838    10.333333
Name: var, Length: 19920, dtype: float64

In [73]:
grouped.loc[grouped.is_same_cl == False].loc[grouped.price['var'] < 1.].price['mean'] - grouped.iloc[grouped.loc[grouped.is_same_cl == False].loc[grouped.price['var'] < 1.].index+1].price['mean']

242     NaN
243     NaN
246     NaN
247     NaN
252     NaN
         ..
39639   NaN
39642   NaN
39643   NaN
39646   NaN
39647   NaN
Name: mean, Length: 2176, dtype: float64

In [74]:
grouped.iloc[grouped.loc[grouped.is_same_cl == False].loc[grouped.price['var'] < 1.].index+1]

            city date mobile hotel_id is_same_cl price
                                                  mean var
243    amsterdam    5      1        9       True  84.0 NaN
247    amsterdam    5      1       12       True  78.0 NaN
253    amsterdam    5      1       34       True  78.0 NaN
275    amsterdam    5      1      117       True  91.0 NaN
309    amsterdam    5      1      264       True  79.0 NaN
...          ...  ...    ...      ...        ...   ...  ..
39631    vilnius   42      0      914       True  54.0 NaN
39635    vilnius   42      0      950       True  71.0 NaN
39639    vilnius   42      0      955       True  54.0 NaN
39643    vilnius   42      0      957       True  56.0 NaN
39647    vilnius   42      0      976       True  74.0 NaN

[1088 rows x 7 columns]

In [75]:
grouped['sign_mean'] = - grouped.price['mean'] * grouped.is_same_cl + grouped.price['mean'] * (1-grouped.is_same_cl)

In [76]:
def percentage(x):
    """ alpha = 1.96 borne Ã  95% pour la loi normale  """
    moy = x.sum()
    return moy/x.max()

percentage.__name__ = 'percentage'

In [77]:
grouped['price_mean']=grouped.price['mean']
grouped['price_var']=grouped.price['var']
grouped.drop('price',axis=1,inplace=True)
grouped

/tmp/ipykernel_4747/819659357.py:3: PerformanceWarning: dropping on a non-lexsorted multi-index without a level parameter may impact performance.
  grouped.drop('price',axis=1,inplace=True)

,city,date,mobile,hotel_id,is_same_cl,sign_mean,price_mean,price_var
,,,,,,,,
0,amsterdam,2,1,9,False,86.666667,86.666667,6.333333
1,amsterdam,2,1,9,True,-84.000000,84.000000,NaN
2,amsterdam,2,1,10,False,156.000000,156.000000,21.000000
3,amsterdam,2,1,10,True,-151.000000,151.000000,NaN
4,amsterdam,2,1,12,False,80.666667,80.666667,6.333333
...,...,...,...,...,...,...,...,...
39835,vilnius,43,0,957,True,-56.000000,56.000000,NaN
39836,vilnius,43,0,974,False,106.666667,106.666667,17.333333
39837,vilnius,43,0,974,True,-104.000000,104.000000,NaN
39838,vilnius,43,0,976,False,75.666667,75.666667,10.333333
39839,vilnius,43,0,976,True,-74.000000,74.000000,NaN

In [94]:
grouped = pd.read_csv('test.csv')

In [95]:
grouped

,Unnamed: 0,city,date,mobile,hotel_id,is_same_cl,sign_mean,price_mean,price_var
0,0,amsterdam,2,1,9,False,86.666667,86.666667,6.333333
1,1,amsterdam,2,1,9,True,-84.000000,84.000000,NaN
2,2,amsterdam,2,1,10,False,156.000000,156.000000,21.000000
3,3,amsterdam,2,1,10,True,-151.000000,151.000000,NaN
4,4,amsterdam,2,1,12,False,80.666667,80.666667,6.333333
...,...,...,...,...,...,...,...,...,...
39835,39835,vilnius,43,0,957,True,-56.000000,56.000000,NaN
39836,39836,vilnius,43,0,974,False,106.666667,106.666667,17.333333
39837,39837,vilnius,43,0,974,True,-104.000000,104.000000,NaN
39838,39838,vilnius,43,0,976,False,75.666667,75.666667,10.333333
39839,39839,vilnius,43,0,976,True,-74.000000,74.000000,NaN

In [100]:
df2 = grouped[['city','date','mobile','hotel_id','price_mean']].groupby(['city','date','mobile','hotel_id']).agg({'price_mean': [percentage]})
df2

                               price_mean
                               percentage
city      date mobile hotel_id
amsterdam 2    1      9          1.969231
                      10         1.967949
                      12         1.966942
                      16         1.965265
                      22         1.966480
...                                   ...
vilnius   43   0      955        1.975904
                      956        1.969027
                      957        1.976744
                      974        1.975000
                      976        1.977974

[19920 rows x 1 columns]

In [107]:
print(f'percentage diff mean : {df2.price_mean.percentage.mean()}')
print(f'percentage diff var : {df2.price_mean.percentage.var()}')

percentage diff mean : 1.9711529825723841
percentage diff var : 0.0002941680171949086